# PyCity Schools Analysis

* As a whole, schools with higher budgets, did not yield better test results. By contrast, schools with higher spending per student actually (\$645-675) underperformed compared to schools with smaller budgets (<\$585 per student).

* As a whole, smaller and medium sized schools dramatically out-performed large sized schools on passing math performances (89-91% passing vs 67%).

* As a whole, charter schools out-performed the public district schools across all metrics. However, more analysis will be required to glean if the effect is due to school practices or the fact that charter schools tend to serve smaller student populations per school. 
---

### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

# Read School and Student Data File and store into Pandas Data Frames
school_data = pd.read_csv(school_data_to_load)
student_data = pd.read_csv(student_data_to_load)

# Combine the data into a single dataset
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])
df = school_data_complete
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

## District Summary

* Calculate the total number of schools

* Calculate the total number of students

* Calculate the total budget

* Calculate the average math score 

* Calculate the average reading score

* Calculate the overall passing rate (overall average score), i.e. (avg. math score + avg. reading score)/2

* Calculate the percentage of students with a passing math score (70 or greater)

* Calculate the percentage of students with a passing reading score (70 or greater)

* Create a dataframe to hold the above results

* Optional: give the displayed data cleaner formatting

In [2]:
school_data_complete.shape

(39170, 11)

In [3]:
Number_of_Schools = df['school_name'].nunique()
Number_of_Schools

15

In [4]:
Student_Count = df['Student ID'].count()
Student_Count

39170

In [5]:
Total_Budget = school_data['budget'].sum()

Total_Budget

24649428

In [6]:
Total_Math_Score = df['math_score'].sum()
Total_Math_Score

3093857

In [7]:
Average_Math_Score = round(Total_Math_Score/Student_Count,2)
Average_Math_Score

78.99

In [8]:
Total_Read_Score = df['reading_score'].sum()
Total_Read_Score

3207155

In [9]:
Average_Read_Score = round(Total_Read_Score/Student_Count,2)
Average_Read_Score

81.88

In [10]:
Overall_Passing_Score = round((Average_Math_Score + Average_Read_Score)/2,2)
Overall_Passing_Score

80.44

In [11]:
#Calculate the percentage of students with a passing math score (70 or greater)
df['math_pass'] = np.where(df['math_score']>=70,"Pass","Fail")
df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget,math_pass
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635,Pass
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635,Fail
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635,Fail
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635,Fail
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635,Pass

In [12]:
#Calculate the percentage of students with a passing reading score (70 or greater)
df['reading_pass'] = np.where(df['reading_score']>=70,"Pass","Fail",)
df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget,math_pass,reading_pass
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635,Pass,Fail
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635,Fail,Pass
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635,Fail,Pass
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635,Fail,Fail
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635,Pass,Pass

In [13]:
pd.value_counts(df['reading_pass'].values)

Pass    33610
Fail     5560
dtype: int64

In [14]:
pd.value_counts(df['math_pass'].values)

Pass    29370
Fail     9800
dtype: int64

In [15]:
math_pass_total = df.loc[df['math_pass'] == "Pass" , :]
math_pass_percentage = round(100*math_pass_total['math_score'].count()/Student_Count,2)
math_pass_percentage
#math_pass_perecentage.head()

74.98

In [16]:
reading_pass_total = df.loc[df['reading_pass'] == "Pass" , :]
reading_pass_percentage = round(100*reading_pass_total['reading_score'].count()/Student_Count,2)
reading_pass_percentage
#reading_pass_perecentage.head()

85.81

In [17]:
District = pd.DataFrame({
                            "Summary total number of schools":[Number_of_Schools],
                             "Total number of students":[Student_Count],
                             "Total budget":[Total_Budget],
                             "Average math score":[Average_Math_Score],
                             "Average reading score":[Average_Read_Score],
                             
                             "% Passing math":[math_pass_percentage],
                             "% Passing reading":[reading_pass_percentage],
                              "% Overall passing rate":[Overall_Passing_Score],
                            })

District['Total number of students']=District['Total number of students'].map("{:,}".format)
District['Total budget']=District['Total budget'].map("${:,}".format)

District

,Summary total number of schools,Total number of students,Total budget,Average math score,Average reading score,% Passing math,% Passing reading,% Overall passing rate
0,15,"39,170","$24,649,428",78.99,81.88,74.98,85.81,80.44

In [18]:
df.columns

Index(['Student ID', 'student_name', 'gender', 'grade', 'school_name',
       'reading_score', 'math_score', 'School ID', 'type', 'size', 'budget',
       'math_pass', 'reading_pass'],
      dtype='object')

In [19]:
df.shape

(39170, 13)

In [20]:
df.head(2)

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget,math_pass,reading_pass
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635,Pass,Fail
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635,Fail,Pass

In [21]:
df['math_pass_val'] = df.math_pass.map({'Pass':100, 'Fail':0})

In [22]:
df.loc[0:4,['math_pass','math_pass_val']]

  math_pass  math_pass_val
0      Pass            100
1      Fail              0
2      Fail              0
3      Fail              0
4      Pass            100

In [23]:
df['reading_pass_val'] = df.reading_pass.map({'Pass':100, 'Fail':0})

In [24]:
df.loc[0:4,['reading_pass','reading_pass_val']]

  reading_pass  reading_pass_val
0         Fail                 0
1         Pass               100
2         Pass               100
3         Fail                 0
4         Pass               100

In [25]:
df['overall_pass'] = df[['math_pass_val','reading_pass_val']].mean(axis=1)

In [26]:
df['budget_per_student'] = round(round(df['budget'],0)/round(df['size'],0),0)

In [27]:
grouped1 = df.groupby(['school_name','type']).mean()
grouped1.head()

,,Student ID,reading_score,math_score,School ID,size,budget,math_pass_val,reading_pass_val,overall_pass,budget_per_student
school_name,type,,,,,,,,,,
Bailey High School,District,20358.5,81.033963,77.048432,7.0,4976.0,3124928.0,66.680064,81.933280,74.306672,628.0
Cabrera High School,Charter,16941.5,83.975780,83.061895,6.0,1858.0,1081356.0,94.133477,97.039828,95.586652,582.0
Figueroa High School,District,4391.0,81.158020,76.711767,1.0,2949.0,1884411.0,65.988471,80.739234,73.363852,639.0
Ford High School,District,36165.0,80.746258,77.102592,13.0,2739.0,1763916.0,68.309602,79.299014,73.804308,644.0
Griffin High School,Charter,12995.5,83.816757,83.351499,4.0,1468.0,917500.0,93.392371,97.138965,95.265668,625.0

In [28]:
type(grouped1)

pandas.core.frame.DataFrame

In [31]:
grouped1 = grouped1.drop('Student ID', axis=1)  #Student ID keeps changing to School ID
grouped1.head()

,,reading_score,math_score,size,budget,math_pass_val,reading_pass_val,overall_pass,budget_per_student
school_name,type,,,,,,,,
Bailey High School,District,81.033963,77.048432,4976.0,3124928.0,66.680064,81.933280,74.306672,628.0
Cabrera High School,Charter,83.975780,83.061895,1858.0,1081356.0,94.133477,97.039828,95.586652,582.0
Figueroa High School,District,81.158020,76.711767,2949.0,1884411.0,65.988471,80.739234,73.363852,639.0
Ford High School,District,80.746258,77.102592,2739.0,1763916.0,68.309602,79.299014,73.804308,644.0
Griffin High School,Charter,83.816757,83.351499,1468.0,917500.0,93.392371,97.138965,95.265668,625.0

In [32]:
grouped1.columns = ['Avg Reading Score','Avg Math Score','Total Students','Total School Budget','% Pass Math','% Pass Reading','% Overall Pass','Per Student Budget']

## School Summary

* Create an overview table that summarizes key metrics about each school, including:
  * School Name
  * School Type
  * Total Students
  * Total School Budget
  * Per Student Budget
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)
  
* Create a dataframe to hold the above results

## Top Performing Schools (By Passing Rate)

* Sort and display the top five schools in overall passing rate

In [33]:
grouped1 = grouped1[['Total Students','Total School Budget','Per Student Budget','Avg Math Score','Avg Reading Score','% Pass Math','% Pass Reading','% Overall Pass']]
grouped1.sort_values(by=['% Overall Pass'],ascending = False).head(5)

,,Total Students,Total School Budget,Per Student Budget,Avg Math Score,Avg Reading Score,% Pass Math,% Pass Reading,% Overall Pass
school_name,type,,,,,,,,
Cabrera High School,Charter,1858.0,1081356.0,582.0,83.061895,83.975780,94.133477,97.039828,95.586652
Thomas High School,Charter,1635.0,1043130.0,638.0,83.418349,83.848930,93.272171,97.308869,95.290520
Pena High School,Charter,962.0,585858.0,609.0,83.839917,84.044699,94.594595,95.945946,95.270270
Griffin High School,Charter,1468.0,917500.0,625.0,83.351499,83.816757,93.392371,97.138965,95.265668
Wilson High School,Charter,2283.0,1319574.0,578.0,83.274201,83.989488,93.867718,96.539641,95.203679

## Bottom Performing Schools (By Passing Rate)

* Sort and display the five worst-performing schools

In [34]:
grouped1.sort_values(by=['% Overall Pass'],ascending = True).head(5)

,,Total Students,Total School Budget,Per Student Budget,Avg Math Score,Avg Reading Score,% Pass Math,% Pass Reading,% Overall Pass
school_name,type,,,,,,,,
Rodriguez High School,District,3999.0,2547363.0,637.0,76.842711,80.744686,66.366592,80.220055,73.293323
Figueroa High School,District,2949.0,1884411.0,639.0,76.711767,81.158020,65.988471,80.739234,73.363852
Huang High School,District,2917.0,1910635.0,655.0,76.629414,81.182722,65.683922,81.316421,73.500171
Johnson High School,District,4761.0,3094650.0,650.0,77.072464,80.966394,66.057551,81.222432,73.639992
Ford High School,District,2739.0,1763916.0,644.0,77.102592,80.746258,68.309602,79.299014,73.804308

## Math Scores by Grade

* Create a table that lists the average Reading Score for students of each grade level (9th, 10th, 11th, 12th) at each school.

  * Create a pandas series for each grade. Hint: use a conditional statement.
  
  * Group each series by school
  
  * Combine the series into a dataframe
  
  * Optional: give the displayed data cleaner formatting

In [35]:
df.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget,math_pass,reading_pass,math_pass_val,reading_pass_val,overall_pass,budget_per_student
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635,Pass,Fail,100,0,50.0,655.0
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635,Fail,Pass,0,100,50.0,655.0
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635,Fail,Pass,0,100,50.0,655.0
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635,Fail,Fail,0,0,0.0,655.0
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635,Pass,Pass,100,100,100.0,655.0

In [36]:
df1 = pd.DataFrame(df[['school_name','grade','math_score']])
df1.head()

         school_name grade  math_score
0  Huang High School   9th          79
1  Huang High School  12th          61
2  Huang High School  12th          60
3  Huang High School  12th          58
4  Huang High School   9th          84

In [37]:
df1 = df1.groupby(['school_name','grade']).mean()
df1.head()

                           math_score
school_name         grade
Bailey High School  10th    76.996772
                    11th    77.515588
                    12th    76.492218
                    9th     77.083676
Cabrera High School 10th    83.154506

## Reading Score by Grade

* Perform the same operations as above for reading scores

In [38]:
df2 = pd.DataFrame(df[['school_name','grade','reading_score']])
df2.head()

         school_name grade  reading_score
0  Huang High School   9th             66
1  Huang High School  12th             94
2  Huang High School  12th             90
3  Huang High School  12th             67
4  Huang High School   9th             97

In [39]:
df1 = df1.groupby(['school_name','grade']).mean()
df1.head()

                           math_score
school_name         grade
Bailey High School  10th    76.996772
                    11th    77.515588
                    12th    76.492218
                    9th     77.083676
Cabrera High School 10th    83.154506

## Scores by School Spending

* Create a table that breaks down school performances based on average Spending Ranges (Per Student). Use 4 reasonable bins to group school spending. Include in the table each of the following:
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)

In [ ]:
# Sample bins. Feel free to create your own bins.
spending_bins = [0, 585, 615, 645, 675]
group_names = ["<$585", "$585-615", "$615-645", "$645-675"]

## Scores by School Size

* Perform the same operations as above, based on school size.

In [ ]:
# Sample bins. Feel free to create your own bins.
size_bins = [0, 1000, 2000, 5000]
group_names = ["Small (<1000)", "Medium (1000-2000)", "Large (2000-5000)"]

## Scores by School Type

* Perform the same operations as above, based on school type.

In [40]:
groupedz = df.groupby(['type']).mean()
groupedz

,Student ID,reading_score,math_score,School ID,size,budget,math_pass_val,reading_pass_val,overall_pass,budget_per_student
type,,,,,,,,,,
Charter,19438.475398,83.902821,83.406183,6.964163,1717.352468,1.024543e+06,93.701821,96.645891,95.173856,598.778498
District,19650.507711,80.962485,76.987026,6.984505,4063.261195,2.611175e+06,66.518387,80.905249,73.711818,643.087300

In [41]:
groupedz = groupedz.drop('Student ID', axis=1)  #Student ID keeps changing to School ID

In [42]:
groupedz = groupedz.drop('School ID', axis=1)

In [43]:
groupedz = groupedz.drop('size', axis=1)

In [44]:
groupedz = groupedz.drop('budget', axis=1)

In [45]:
groupedz = groupedz.drop('budget_per_student', axis=1)

In [46]:
groupedz.columns = ['Avg Reading Score','Avg Math Score','% Pass Math','% Pass Reading','% Overall Pass']
groupedz = groupedz[['Avg Math Score','Avg Reading Score','% Pass Math','% Pass Reading','% Overall Pass']]
groupedz.sort_values(by=['% Overall Pass'],ascending = False).head(5)

,Avg Math Score,Avg Reading Score,% Pass Math,% Pass Reading,% Overall Pass
type,,,,,
Charter,83.406183,83.902821,93.701821,96.645891,95.173856
District,76.987026,80.962485,66.518387,80.905249,73.711818